##Приклад створення матриць, операції зі структурою матриць
v_in_row = [1, 2, 3, 4, 5] %вектор-рядок
v_in_col = [1; 2; 3; 4; 5] %вектор-стовпець

A =[ 1 2 3 4; 0 2 6 5; 7 9 7 8] %матриця
A( 2:3 , 1:2 ) %зріз матриці
display "Створення матриці з одиниць"

C = ones(3)
D = ones(3, 2)
E = ones(3, 3, 2)

display "Створення матриць з нулів"

C1 = zeros(2)
D2 = zeros(2, 3)
E2 = zeros(2, 2, 3)

clear all;

display ("Заповнення матриці випадковими числами")

a = rand()
b = rand([3 2])
v = rand([4; 1])
w = rand([1; 4])
z = rand([-20 20], 4)

##додавання елементів, рядків та стовпчиків
display('Додавання у матрицю стовпця')
a=zeros(3) ,a=[a, ones(3,1)]
b=zeros(3) , b=[ones(3,1), b]

display("Додали не просто елемент, а цілий стовпчик")

b(1,5)=7%

display('Додавання у матрицю рядка')

a=zeros(3) 
a=[a; ones(1,3)]
b=zeros(3)
b=[ones(1,3); b]

display ('Додали не просто елемент, а цілий рядок')
b(4,1) = 7%
clear all


##видалення елементів

display("Вилучення елементів")
A=[5 5 5; 3 10 2; 2 8 4]

display("Видалення другого рядка")
A(2,:)=[]

display ("Видалення третього стовпчика")
A=[5 5 5; 3 10 2; 2 8 4]
A(:, 3)=[]

display ("Видалення двох останніх елементів")
A=[5 5 5; 3 10 2; 2 8 4]
A(2:end)=[]

display ("Видалення трьох елементів")
A=[1 2 3 4 5 6 7 8 9]
A(4:6)=[]

##спеціальні матриці

display ("Одинична діагональна матриця")

e=eye(3)
f=eye(4,5)

display ("Магічний квадрат")

m= magic(5)
q=eye(5)

display ("Функції від матриці")
display ("sin(m)")
sin(m)

display ("sqrt(m)")
sqrt(m)

display ("m+3")



